# PresentItemsAsSubelements Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainer..::..PresentItemsAsSubelements Property
RebarContainer Class See Also
---
Identifies if Items should be presented in schedules and tags as separate subelements.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool PresentItemsAsSubelements { get; set; }
```

Visual Basic
---
```text
Public Property PresentItemsAsSubelements As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool PresentItemsAsSubelements {
	bool get ();
	void set (bool value);
}
```

# See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace